code/Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<BasedOn>
				<xr:Item>Document.Договор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаличными</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудник</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code/Documents/Оплата/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	Объект.Сумма = ПолучитьСумму(Объект.НомерДоговора);
	Объект.Клиент = ПолучитьКлиента(Объект.НомерДоговора);
	Объект.Сотрудник = ПолучитьСотрудника(Объект.НомерДоговора);
	КонецПроцедуры

&НаСервере
Функция
	ПолучитьСумму(сумма)
	Возврат сумма.СуммаДоговора;
конецфункции

&НаСервере
Функция
	ПолучитьКлиента(клиент)
Возврат клиент.Клиент;
конецфункции    

&НаСервере
Функция
	ПолучитьСотрудника(сотрудник)
Возврат сотрудник.Сотрудник;
конецфункции
